module game {
    export class RandomName {
        public static sAtr = [
            "温柔的", "内向的", "腼腆的", "害羞的", "多疑的", "直率的", "活泼的", "开朗的", "滑稽的",
            "古怪的", "怪异的", "宽容的", "多情的", "冷淡的", "热情的", "拘谨的", "严厉的", "凶残的",
            "残忍的", "无情的", "懦弱的", "飘逸的", "圣洁的", "纯洁的", "清纯的", "可爱的", "贤慧的",
            "慈爱的", "仁慈的", "老实的", "木讷的", "慷慨的", "大方的", "随便的", "暴躁的", "急躁的",
            "尖酸的", "刻薄的", "侠义的", "忠诚的", "震怒的", "恼怒的", "大怒的", "气愤的", "激怒的",
            "发狂的", "愤慨的", "发火的", "抓狂的", "悲伤的", "想哭的", "哀伤的", "伤心的", "沮丧的",
            "悲哀的", "狂喜的", "快乐的", "欢喜的", "平静的", "舒服的", "轻松的", "兴奋的", "开心的",
            "幸运的", "感动的", "警觉的", "傍徨的", "着急的", "焦急的", "无聊的", "孤独的", "孤单的",
            "寂寞的", "空虚的", "倒霉的", "无力的", "无奈的", "泄气的", "无助的", "失望的", "颓丧的",
            "活泼的", "完美的", "体贴的", "敏感的", "拘谨的", "羞涩的", "乐观的", "坦率的", "有趣的",
            "忠诚的", "友善的", "自信的", "深沉的", "幽默的", "执着的", "知足的", "勤劳的", "完美的",
            "无畏的", "芳香的", "专横的", "忸怩的", "唠叨的", "保守的", "健忘的", "直率的", "挑剔的",
            "胆小的", "急躁的", "固执的", "自负的", "幼稚的", "鲁莽的", "消极的", "冷漠的", "虚荣的",
            "老练的", "胆怯的", "孤僻的", "懒惰的", "多疑的", "拖延的", "善变的", "狡猾的", "朴素的",
            "大方的", "整洁的", "时髦的", "讲究的", "邋遢的", "俗气的", "庄重的", "端庄的", "安闲的",
            "安详的", "恬静的", "文雅的", "镇静的", "沉着的", "诚挚的", "憨厚的", "潇洒的", "妩媚的",
            "羞涩的", "腼腆的", "严厉的", "冷酷的", "坚毅的", "傲慢的", "疲惫的", "沮丧的", "失神的",
            "作死的"];

        public static sNtr = [
            "桌子", "椅子", "凳子", "瓶子", "杯子", "木桶", "大侠", "土豪", "青春", "大叔", "苹果",
            "香蕉", "泡菜", "泥巴", "菜鸟", "肉鸡", "木马", "肥羊", "青蛙", "马甲", "小强", "欧巴",
            "正太", "萝莉", "小白", "小黑", "食神", "武将", "木柴", "战士", "村长", "黑锅", "蜘蛛",
            "蜜蜂", "土著", "玻璃", "大虾", "阿布", "鹌鹑", "樱桃", "葵花", "老公", "拖鞋", "手机",
            "纸巾", "手套", "宅男", "腐女", "屌丝", "表叔", "尼玛", "元芳", "大师", "老僧", "酱油",
            "眼镜", "土豆", "西瓜", "黄瓜", "洋葱", "大神", "长脸", "圆脸", "方脸", "大嘴", "老虎",
            "狮子", "大象", "黑豹", "鳄鱼", "正恩", "正日", "普京", "牙刷", "橘子", "柚子", "板栗",
            "蘑菇", "火柴", "键盘", "鼠标", "耳机", "电话", "大头", "小头", "厚唇", "眼神", "黑板",
            "白板", "表情", "袋子", "肚腩", "熊猫", "黑熊", "考拉", "猫咪", "鹦鹉", "海豹", "海象",
            "鲨鱼", "猩猩", "才子", "润发", "德华", "富城", "学友", "小明", "老王", "建刚", "国庆",
            "国王", "士兵", "君子", "绿茶", "红茶", "云长", "玄德", "孟德", "翼德", "子龙", "紫龙",
            "卧龙", "青龙", "黄龙", "白龙", "朱雀", "鸡蛋", "花生", "蛋壳", "豆子", "口袋", "大爷",
            "孤王", "太宗", "黄金", "白银", "元宝", "兔子", "板牙", "门牙", "眉毛", "王者", "钻石",
            "星星", "太阳", "月亮", "金刚", "羊驼", "骆驼", "黑马", "白马", "龙猫", "悟空", "悟能",
            "悟净", "三藏", "土地", "山神", "手掌", "大饼", "大兵", "冰块", "包子", "馒头", "花卷",
            "帽子", "皮带", "毛笔", "大众", "奥迪", "奔驰", "百威", "青岛", "啤酒", "白酒", "黄酒",
            "红酒", "米酒", "老酒", "火星", "土星", "金星", "水星", "电脑", "木块", "大米", "玉米",
            "萝卜", "白菜", "英雄", "财神", "厨神", "大厨", "钞票", "大哥", "硬币"];
        public constructor(){

        }

        public static getRandomName(): string {
            var name = "";
            var len1: number = this.sAtr.length;
            var len2: number = this.sNtr.length;
            var ran1: number = Math.floor(Math.random() * (len1-1));
            var ran2: number = Math.floor(Math.random() * (len2 - 1));
            name = this.sAtr[ran1] + this.sNtr[ran2];
            return name;
        }
    }
}